PAE-HP-TARDOR-2025/firmware_updater/librarywithfunctions/master/demomaster/sdkconfig.defaults
# Master Uploader sdkconfig defaults
# Copy this to sdkconfig or run idf.py menuconfig

CONFIG_IDF_TARGET="esp32"

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# SPIFFS
CONFIG_MASTER_USE_SPIFFS=y
CONFIG_MASTER_SPIFFS_BASE_PATH="/spiffs"
CONFIG_MASTER_SPIFFS_PARTITION_LABEL="storage"

# Master configuration
CONFIG_MASTER_NODE_ID=1
CONFIG_MASTER_TARGET_NODE_ID=10
CONFIG_MASTER_TWAI_TX_GPIO=5
CONFIG_MASTER_TWAI_RX_GPIO=4
CONFIG_MASTER_FIRMWARE_PATH="/spiffs/slave_fw.bin"
CONFIG_MASTER_MAX_CHUNK_BYTES=256
CONFIG_MASTER_UPLOAD_ON_STARTUP=y
CONFIG_MASTER_SKIP_IF_CRC_MATCH=y

# Flash size
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
